# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [0]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [0]:
x1 = pd.Series(np.random.randint(1, high=5,size=100))
x2 = pd.Series(np.random.randint(1, high=4,size=100))
x3 = pd.Series(np.random.randint(10000, high=30001,size=100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [6]:
df = pd.concat([x1, x2, x3], axis=1)
df.head()

   0  1      2
0  2  2  28651
1  1  3  25100
2  2  3  19467
3  4  1  29932
4  1  2  12423

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [7]:
df.rename(columns = {0: 'bedrs', 1: 'bathrs', 2: 'price_sqr_meter'}, inplace=True)
df.head()

   bedrs  bathrs  price_sqr_meter
0      2       2            28651
1      1       3            25100
2      2       3            19467
3      4       1            29932
4      1       2            12423

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [14]:
# join concat the values
bigcolumn = pd.concat([x1, x2, x3], axis=0)

# it is still a Series, so we need to transform it to a DataFrame
bigcolumn = bigcolumn.to_frame()
print(type(bigcolumn))

<class 'pandas.core.frame.DataFrame'>

In [15]:
bigcolumn

        0
0       2
1       1
2       2
3       4
4       1
..    ...
95  26020
96  15485
97  29472
98  16270
99  19384

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [10]:
len(bigcolumn)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [16]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

         0
0        2
1        1
2        2
3        4
4        1
..     ...
295  26020
296  15485
297  29472
298  16270
299  19384

[300 rows x 1 columns]